# 第五章 变形

In [1]:
 import numpy as np
 import pandas as pd

In [3]:
%cd drive/MyDrive/
!ls

[Errno 2] No such file or directory: 'drive/MyDrive/'
/content/drive/MyDrive
'Colab Notebooks'   data

## 一、长宽表的变形
* 性别存在某一列中，就是关于性别的长表
* 性别作为列名，列中的元素是某一其他的相关特征数值，则是关于性别的宽表

In [4]:
# 长表
pd.DataFrame({'Gender':['F','F','M','M'],
       'Height':[163, 160, 175, 180]})

  Gender  Height
0      F     163
1      F     160
2      M     175
3      M     180

In [5]:
# 宽表
pd.DataFrame({'Height: F':[163, 160],
       'Height: M':[175, 180]})

   Height: F  Height: M
0        163        175
1        160        180

* 本质上是与布局模式有关，即到底是以 long 的状态存储还是以 wide 的状态存储

### 1. pivot
pivot 是一种典型的长表变宽表的函数

In [7]:
df = pd.DataFrame({'Class':[1,1,2,2],
          'Name':['San Zhang','San Zhang','Si Li','Si Li'],
          'Subject':['Chinese','Math','Chinese','Math'],
          'Grade':[80,75,90,85]})
df

   Class       Name  Subject  Grade
0      1  San Zhang  Chinese     80
1      1  San Zhang     Math     75
2      2      Si Li  Chinese     90
3      2      Si Li     Math     85

* 长变宽：三个要素，分别是变形后的行索引、需要转到列索引的列，以及这些列和行索引对应的数值。分别对应 index, columns, values 参数。
* 新生成表的列索引是 columns 对应列的 unique 值，而新表的行索引是 index 对应列的 unique 值，而 values 对应了想要展示的数值列。

In [8]:
# 把语文和数学分数作为列来展示
df.pivot(index='Name', columns='Subject', values='Grade')

Subject    Chinese  Math
Name
San Zhang       80    75
Si Li           90    85

* 利用 pivot 进行变形操作需要满足唯一性的要求，即由于在新表中的行列索引对应了唯一的 value ，因此原表中的 index 和 columns 对应两个列的行组合必须唯一

In [10]:
#把原表中第二行张三的数学改为语文就会报错
#这是由于 Name 与 Subject 的组合中两次出现 ("San Zhang", "Chinese") ，从而最后不能够确定到底变形后应该是填写80分还是75分
df.loc[1, 'Subject'] = 'Chinese'
try:
 df.pivot(index='Name', columns='Subject', values='Grade')
except Exception as e:
  Err_Msg = e
Err_Msg

ValueError('Index contains duplicate entries, cannot reshape')

* pandas 从 1.1.0 开始， pivot 相关的三个参数允许被设置为列表。因此可以返回多级索引

In [12]:
#下表中六列分别为班级、姓名、测试类型（期中考试和期末考试）、科目、成绩、排名
df = pd.DataFrame({'Class':[1, 1, 2, 2, 1, 1, 2, 2],
           'Name':['San Zhang', 'San Zhang', 'Si Li', 'Si Li',
               'San Zhang', 'San Zhang', 'Si Li', 'Si Li'],
           'Examination': ['Mid', 'Final', 'Mid', 'Final',
                   'Mid', 'Final', 'Mid', 'Final'],
           'Subject':['Chinese', 'Chinese', 'Chinese', 'Chinese',
                 'Math', 'Math', 'Math', 'Math'],
           'Grade':[80, 75, 85, 65, 90, 85, 92, 88],
           'rank':[10, 15, 21, 15, 20, 7, 6, 2]})
df

   Class       Name Examination  Subject  Grade  rank
0      1  San Zhang         Mid  Chinese     80    10
1      1  San Zhang       Final  Chinese     75    15
2      2      Si Li         Mid  Chinese     85    21
3      2      Si Li       Final  Chinese     65    15
4      1  San Zhang         Mid     Math     90    20
5      1  San Zhang       Final     Math     85     7
6      2      Si Li         Mid     Math     92     6
7      2      Si Li       Final     Math     88     2

In [13]:
# 把测试类型和科目联合组成的四个类别（期中语文、期末语文、期中数学、期末数学）转到列索引，并且同时统计成绩和排名
pivot_multi = df.pivot(index = ['Class', 'Name'],
             columns = ['Subject','Examination'],
             values = ['Grade','rank'])
pivot_multi

                  Grade                     rank
Subject         Chinese       Math       Chinese       Math
Examination         Mid Final  Mid Final     Mid Final  Mid Final
Class Name
1     San Zhang      80    75   90    85      10    15   20     7
2     Si Li          85    65   92    88      21    15    6     2

* 根据唯一性原则，新表的行索引等价于对 index 中的多列使用 drop_duplicates ，而列索引的长度为 values 中的元素个数乘以 columns 的唯一组合数量（与 index 类似）

### 2.pivot_table
* pivot 的使用依赖于唯一性条件，那如果不满足唯一性条件，那么必须通过聚合操作使得相同行列组合对应的多个值变为一个值

In [14]:
# 张三和李四都参加了两次语文考试和数学考试，按照学院规定，最后的成绩是两次考试分数的平均值
df = pd.DataFrame({'Name':['San Zhang', 'San Zhang',
               'San Zhang', 'San Zhang',
               'Si Li', 'Si Li', 'Si Li', 'Si Li'],
           'Subject':['Chinese', 'Chinese', 'Math', 'Math',
                 'Chinese', 'Chinese', 'Math', 'Math'],
           'Grade':[80, 90, 100, 90, 70, 80, 85, 95]})
df

        Name  Subject  Grade
0  San Zhang  Chinese     80
1  San Zhang  Chinese     90
2  San Zhang     Math    100
3  San Zhang     Math     90
4      Si Li  Chinese     70
5      Si Li  Chinese     80
6      Si Li     Math     85
7      Si Li     Math     95

* pandas 中提供了 pivot_table 来实现，其中的 aggfunc 参数就是使用的聚合函数

In [15]:
df.pivot_table(index = 'Name',
        columns = 'Subject',
        values = 'Grade',
        aggfunc = 'mean')

Subject    Chinese  Math
Name
San Zhang       85    95
Si Li           75    90

In [16]:
# 还可以传入以序列为输入标量为输出的聚合函数来实现自定义操作，上述功能可以等价写出：
df.pivot_table(index = 'Name',
        columns = 'Subject',
        values = 'Grade',
        aggfunc = lambda x:x.mean())

Subject    Chinese  Math
Name
San Zhang       85    95
Si Li           75    90

*  pivot_table 具有边际汇总的功能，可以通过设置 margins=True 来实现，其中边际的聚合方式与 aggfunc 中给出的聚合方法一致

In [18]:
# 分别统计语文均分和数学均分、张三均分和李四均分，以及总体所有分数的均分
df.pivot_table(index = 'Name',
        columns = 'Subject',
        values = 'Grade',
        aggfunc = 'mean',
        margins = True)

Subject    Chinese  Math    All
Name
San Zhang       85  95.0  90.00
Si Li           75  90.0  82.50
All             80  92.5  86.25

### 3.melt
*  melt 函数就起到了逆操作把宽表转为长表

In [19]:
df = pd.DataFrame({'Class':[1,2],
            'Name':['San Zhang', 'Si Li'],
            'Chinese':[80, 90],
            'Math':[80, 75]})
df

   Class       Name  Chinese  Math
0      1  San Zhang       80    80
1      2      Si Li       90    75

In [22]:
df_melted = df.melt(id_vars = ['Class', 'Name'],
                     value_vars = ['Chinese', 'Math'],
                     var_name = 'Subject',
                     value_name = 'Grade')
df_melted

   Class       Name  Subject  Grade
0      1  San Zhang  Chinese     80
1      2      Si Li  Chinese     90
2      1  San Zhang     Math     80
3      2      Si Li     Math     75

In [23]:
#  melt 和 pivot 是一组互逆过程
df_unmelted = df_melted.pivot(index = ['Class', 'Name'],
                columns='Subject',
                values='Grade')
df_unmelted # 下面需要恢复索引，并且重命名列索引名称

Subject          Chinese  Math
Class Name
1     San Zhang       80    80
2     Si Li           90    75

### 4.wide_to_long
* melt 方法中，在列索引中被压缩的一组值对应的列元素只能代表同一层次的含义，即 values_name
* 列中包含交叉类别，想要把values_name对应的值扩充为两列，可以用 wide_to_long 函数来完成

In [24]:
df = pd.DataFrame({'Class':[1,2],'Name':['San Zhang', 'Si Li'],
           'Chinese_Mid':[80, 75], 'Math_Mid':[90, 85],
           'Chinese_Final':[80, 75], 'Math_Final':[90, 85]})
df

   Class       Name  Chinese_Mid  Math_Mid  Chinese_Final  Math_Final
0      1  San Zhang           80        90             80          90
1      2      Si Li           75        85             75          85

In [25]:
pd.wide_to_long(df,
        stubnames=['Chinese', 'Math'],
        i = ['Class', 'Name'],
        j='Examination',
        sep='_',
        suffix='.+')

                             Chinese  Math
Class Name      Examination
1     San Zhang Mid               80    90
                Final             80    90
2     Si Li     Mid               75    85
                Final             75    85

In [26]:
# 把之前在 pivot 一节中多列操作的结果（产生了多级索引），利用 wide_to_long 函数，将其转为原来的形态
res = pivot_multi.copy()
res.columns = res.columns.map(lambda x:'_'.join(x))
res = res.reset_index()
res = pd.wide_to_long(res, stubnames=['Grade', 'rank'],
               i = ['Class', 'Name'],
               j = 'Subject_Examination',
               sep = '_',
               suffix = '.+')
res = res.reset_index()

res[['Subject', 'Examination']] = res[
         'Subject_Examination'].str.split('_', expand=True)

res = res[['Class', 'Name', 'Examination',
       'Subject', 'Grade', 'rank']].sort_values('Subject')
res = res.reset_index(drop=True)

res

   Class       Name Examination  Subject  Grade  rank
0      1  San Zhang         Mid  Chinese     80    10
1      1  San Zhang       Final  Chinese     75    15
2      2      Si Li         Mid  Chinese     85    21
3      2      Si Li       Final  Chinese     65    15
4      1  San Zhang         Mid     Math     90    20
5      1  San Zhang       Final     Math     85     7
6      2      Si Li         Mid     Math     92     6
7      2      Si Li       Final     Math     88     2

## 二、索引的变形

### 1.stack与unstack

* unstack 函数的作用是把行索引转为列索引

In [27]:
df = pd.DataFrame(np.ones((4,2)),
           index = pd.Index([('A', 'cat', 'big'),
                     ('A', 'dog', 'small'),
                     ('B', 'cat', 'big'),
                     ('B', 'dog', 'small')]),
  columns=['col_1', 'col_2'])
df

             col_1  col_2
A cat big      1.0    1.0
  dog small    1.0    1.0
B cat big      1.0    1.0
  dog small    1.0    1.0

In [28]:
df.unstack()

      col_1       col_2
        big small   big small
A cat   1.0   NaN   1.0   NaN
  dog   NaN   1.0   NaN   1.0
B cat   1.0   NaN   1.0   NaN
  dog   NaN   1.0   NaN   1.0

* unstack 的主要参数是移动的层号，默认转化最内层，移动到列索引的最内层，同时支持同时转化多个层

In [29]:
df.unstack(2)

      col_1       col_2
        big small   big small
A cat   1.0   NaN   1.0   NaN
  dog   NaN   1.0   NaN   1.0
B cat   1.0   NaN   1.0   NaN
  dog   NaN   1.0   NaN   1.0

In [30]:
df.unstack([0,2])

    col_1                  col_2
        A          B           A          B
      big small  big small   big small  big small
cat   1.0   NaN  1.0   NaN   1.0   NaN  1.0   NaN
dog   NaN   1.0  NaN   1.0   NaN   1.0  NaN   1.0

* 类似于 pivot 中的唯一性要求，在 unstack 中必须保证 被转为列索引的行索引层 和 被保留的行索引层 构成的组合是唯一的

In [31]:
# 把前两个列索引改成相同的破坏唯一性，那么就会报错
my_index = df.index.to_list()
my_index[1] = my_index[0]
df.index = pd.Index(my_index)
df

             col_1  col_2
A cat big      1.0    1.0
      big      1.0    1.0
B cat big      1.0    1.0
  dog small    1.0    1.0

In [32]:
try:
  df.unstack()
except Exception as e:
  Err_Msg = e
Err_Msg

ValueError('Index contains duplicate entries, cannot reshape')

* 与 unstack 相反， stack 的作用就是把列索引的层压入行索引，其用法完全类似

In [33]:
df = pd.DataFrame(np.ones((4,2)),
           index = pd.Index([('A', 'cat', 'big'),
                     ('A', 'dog', 'small'),
                     ('B', 'cat', 'big'),
                     ('B', 'dog', 'small')]),
           columns=['index_1', 'index_2']).T
df

           A          B
         cat   dog  cat   dog
         big small  big small
index_1  1.0   1.0  1.0   1.0
index_2  1.0   1.0  1.0   1.0

In [34]:
df.stack()

                 A         B
               cat  dog  cat  dog
index_1 big    1.0  NaN  1.0  NaN
        small  NaN  1.0  NaN  1.0
index_2 big    1.0  NaN  1.0  NaN
        small  NaN  1.0  NaN  1.0

In [35]:
df.stack([1, 2])

                     A    B
index_1 cat big    1.0  1.0
        dog small  1.0  1.0
index_2 cat big    1.0  1.0
        dog small  1.0  1.0

### 2.聚合与变形的关系
* 除了带有聚合效果的 pivot_table 以外，所有的函数在变形前后并不会带来 values 个数的改变，只是这些值在呈现的形式上发生了变化

## 三、其他变形函数

### 1.crosstab
* crosstab 并不是一个值得推荐使用的函数，因为它能实现的所有功能 pivot_table 都能完成，并且速度更快
* 在默认状态下， crosstab 可以统计元素组合出现的频数，即 count 操作

In [36]:
# 统计 learn_pandas数据集中学校和转系情况对应的频数
df = pd.read_csv('data/learn_pandas.csv')
pd.crosstab(index = df.School, columns = df.Transfer)

Transfer                        N  Y
School
Fudan University               38  1
Peking University              28  2
Shanghai Jiao Tong University  53  0
Tsinghua University            62  4

In [37]:
# 这等价于如下 crosstab 的如下写法，这里的 aggfunc 即聚合参数
pd.crosstab(index = df.School, columns = df.Transfer,
       values = [0]*df.shape[0], aggfunc = 'count')

Transfer                          N    Y
School
Fudan University               38.0  1.0
Peking University              28.0  2.0
Shanghai Jiao Tong University  53.0  NaN
Tsinghua University            62.0  4.0

* 可以利用 pivot_table 进行等价操作，由于这里统计的是组合的频数，因此 values 参数无论传入哪一个列都不会影响最后的结果

In [38]:
df.pivot_table(index = 'School',
        columns = 'Transfer',
        values = 'Name',
        aggfunc = 'count')

Transfer                          N    Y
School
Fudan University               38.0  1.0
Peking University              28.0  2.0
Shanghai Jiao Tong University  53.0  NaN
Tsinghua University            62.0  4.0

* crosstab 的对应位置传入的是具体的序列
* pivot_table 传入的是被调用表对应的名字，若传入序列对应的值则会报错 
* 除了默认状态下的 count 统计，所有的聚合字符串和返回标量的自定义函数都是可用的

In [39]:
#统计对应组合的身高均值
pd.crosstab(index = df.School, columns = df.Transfer,
      values = df.Height, aggfunc = 'mean')

Transfer                                N       Y
School
Fudan University               162.043750  177.20
Peking University              163.429630  162.40
Shanghai Jiao Tong University  163.953846     NaN
Tsinghua University            163.253571  164.55

### 2.explode
explode 参数能够对某一列的元素进行纵向的展开，被展开的单元格必须存储 list, tuple, Series, np.ndarray 中的一种类型

In [40]:
 df_ex = pd.DataFrame({'A': [[1, 2],
             'my_str',
              {1, 2},
              pd.Series([3, 4])],
             'B': 1})
 df_ex.explode('A')

        A  B
0       1  1
0       2  1
1  my_str  1
2  {1, 2}  1
3       3  1
3       4  1

### 3.get_dummies
* get_dummies 是用于特征构建的重要函数之一，其作用是把类别特征转为指示变量

In [41]:
# 对年级一列转为指示变量，属于某一个年级的对应列标记为1，否则为0
pd.get_dummies(df.Grade).head()

   Freshman  Junior  Senior  Sophomore
0         1       0       0          0
1         1       0       0          0
2         0       0       1          0
3         0       0       0          1
4         0       0       0          1

## EX1 美国非法药物数据集

In [42]:
df = pd.read_csv('data/drugs.csv').sort_values([
    'State','COUNTY','SubstanceName'],ignore_index=True)
df.head(3)

   YYYY State COUNTY  SubstanceName  DrugReports
0  2011    KY  ADAIR  Buprenorphine            3
1  2012    KY  ADAIR  Buprenorphine            5
2  2013    KY  ADAIR  Buprenorphine            4

In [45]:
#Q1
res = df.pivot(index=['State','COUNTY','SubstanceName'],
         columns='YYYY',values='DrugReports'
         ).reset_index().rename_axis(columns={'YYYY':''})
res.head(5)

  State COUNTY  SubstanceName  2010  2011  2012  2013  2014  2015  2016  2017
0    KY  ADAIR  Buprenorphine   NaN   3.0   5.0   4.0  27.0   5.0   7.0  10.0
1    KY  ADAIR        Codeine   NaN   NaN   1.0   NaN   NaN   NaN   NaN   1.0
2    KY  ADAIR       Fentanyl   NaN   NaN   1.0   NaN   NaN   NaN   NaN   NaN
3    KY  ADAIR         Heroin   NaN   NaN   1.0   2.0   NaN   1.0   NaN   2.0
4    KY  ADAIR    Hydrocodone   6.0   9.0  10.0  10.0   9.0   7.0  11.0   3.0

In [46]:
#Q2
res_melted = res.melt(id_vars = ['State','COUNTY','SubstanceName'],
            value_vars = res.columns[-8:],
            var_name = 'YYYY',
            value_name = 'DrugReports').dropna(
            subset=['DrugReports'])

res_melted = res_melted[df.columns].sort_values([
       'State','COUNTY','SubstanceName'],ignore_index=True
       ).astype({'YYYY':'int64', 'DrugReports':'int64'})
res_melted.equals(df)

True

In [47]:
#Q3
res = df.pivot_table(index='YYYY', columns='State',
           values='DrugReports', aggfunc='sum')
res.head(3)

State     KY     OH     PA    VA    WV
YYYY
2010   10453  19707  19814  8685  2890
2011   10289  20330  19987  6749  3271
2012   10722  23145  19959  7831  3376

## EX2 特殊的特殊的wide_to_long方法

从功能上看， melt 方法应当属于 wide_to_long 的一种特殊情况，即 stubnames 只有一类。请使用 wide_to_long 生成 melt 一节中的 df_melted 。（提示：对列名增加适当的前缀）

In [48]:
df = pd.DataFrame({'Class':[1,2],
          'Name':['San Zhang', 'Si Li'],
          'Chinese':[80, 90],
          'Math':[80, 75]})
df

   Class       Name  Chinese  Math
0      1  San Zhang       80    80
1      2      Si Li       90    75